; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v10)
             (pred_3 ?v1 ?v5)
             (pred_12 ?v4 ?v5)
             (pred_5 ?v6 ?v4 )
	     (pred_1 ?v4)
             (pred_2 ?v13)
             (pred_6 ?v1)
             (pred_7 ?v5)
             (pred_4 ?v4)
             (pred_9 ?v1)
             (pred_8 ?v4)
             (pred_11 ))



(:action op_5
:parameters (?v12 ?v2 ?v7 ?v3)
:precondition (and (pred_2 ?v12) (pred_2 ?v2) (pred_6 ?v7) (pred_7 ?v3)
          (pred_10 ?v12 ?v2) (pred_3 ?v7 ?v3)
                   (pred_12 ?v2 ?v3) (pred_1 ?v12) 
                   (pred_4 ?v2) (pred_9 ?v7))
:effect (and  (pred_8 ?v2) (not (pred_4 ?v2))))


(:action op_3
:parameters (?v12 ?v8)
:precondition (and (pred_2 ?v12) (pred_2 ?v8)
               (pred_1 ?v12) (pred_10 ?v12 ?v8) (pred_8 ?v8))
:effect (and (pred_1 ?v8) (not (pred_1 ?v12))))

(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_2 ?v12) (pred_6 ?v7) 
                  (pred_1 ?v12) (pred_5 ?v7 ?v12) (pred_11 ))
:effect (and (pred_9 ?v7)
   (not (pred_5 ?v7 ?v12)) (not (pred_11 ))))


(:action op_4
:parameters (?v12 ?v9 ?v11)
:precondition (and (pred_2 ?v12) (pred_6 ?v9) (pred_6 ?v11)
                  (pred_1 ?v12) (pred_9 ?v11) (pred_5 ?v9 ?v12))
:effect (and (pred_9 ?v9) (pred_5 ?v11 ?v12)
        (not (pred_9 ?v11)) (not (pred_5 ?v9 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_2 ?v12) (pred_6 ?v7) 
                  (pred_1 ?v12) (pred_9 ?v7))
:effect (and (pred_11 ) (pred_5 ?v7 ?v12) (not (pred_9 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_10 obj_13 obj_07 obj_06 obj_17 obj_08 obj_18 obj_20 obj_12 obj_05 obj_21 obj_16 obj_04 obj_09 obj_19
    obj_15 obj_03
    obj_11 obj_01 obj_02
    )

    (:init
       (pred_11)

       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_06)
       (pred_2 obj_17)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_20)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_21)
       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_09)
       (pred_2 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_02)

       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_21)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_21 obj_05)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_05)
       (pred_4 obj_13)
       (pred_12  obj_08 obj_15)
       (pred_12  obj_05 obj_03)
       (pred_12  obj_13 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_18)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_19)

       (pred_3  obj_11 obj_15)
       (pred_3  obj_01 obj_03)
       (pred_3  obj_02 obj_03)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_01 obj_18)
       (pred_5 obj_02 obj_18)
       (pred_1 obj_14)
    )

    (:goal (and
       (pred_5 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_1 obj_08)))
)
)

; plan
1. (op_3 obj_14 obj_10)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_10)
   goals met: 0 of 1
2. (op_3 obj_10 obj_17)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_17)
   goals met: 0 of 1
3. (op_3 obj_17 obj_12)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_11)
   deleted: (pred_5 obj_11 obj_12) (pred_11)
   added: (pred_9 obj_11)
   goals met: 0 of 1
5. (op_3 obj_12 obj_17)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_08 obj_11 obj_15)
   deleted: (pred_4 obj_08)
   added: (pred_8 obj_08)
   goals met: 0 of 1
7. (op_3 obj_17 obj_10)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_5 obj_10 obj_13 obj_11 obj_15)
   deleted: (pred_4 obj_13)
   added: (pred_8 obj_13)
   goals met: 0 of 1
9. (op_2 obj_10 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_11) (pred_5 obj_11 obj_10)
   goals met: 0 of 1
10. (op_3 obj_10 obj_13)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_13)
   goals met: 0 of 1
11. (op_3 obj_13 obj_07)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_07)
   goals met: 0 of 1
12. (op_3 obj_07 obj_18)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_18)
   goals met: 0 of 1
13. (op_1 obj_18 obj_02)
   deleted: (pred_5 obj_02 obj_18) (pred_11)
   added: (pred_9 obj_02)
   goals met: 0 of 1
14. (op_3 obj_18 obj_21)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_21)
   goals met: 0 of 1
15. (op_5 obj_21 obj_05 obj_02 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_8 obj_05)
   goals met: 0 of 1
16. (op_3 obj_21 obj_05)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_05)
   goals met: 0 of 1
17. (op_2 obj_05 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_11) (pred_5 obj_02 obj_05)
   goals met: 1 of 1
